data/test/orders/withRefund.json

{
  "lines": [
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 40,
      "amount_debited": 0,
      "balance": 6865.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:29:39Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": "1123",
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": "TAXDEFAULT",
      "shop_tax_rate": 20,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "REFUND_COMMISSION_VAT",
      "vat_rate": 20
    },
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 200,
      "amount_debited": 0,
      "balance": 6856.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:29:39Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": "1123",
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": null,
      "shop_tax_rate": 20,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "REFUND_COMMISSION_FEE",
      "vat_rate": 20
    },
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 0,
      "amount_debited": 0,
      "balance": 6811.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:29:39Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": "1123",
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": null,
      "shop_tax_rate": null,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "REFUND_ORDER_SHIPPING_AMOUNT",
      "vat_rate": null
    },
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 0,
      "amount_debited": 300,
      "balance": 6811.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:29:39Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": "1123",
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": null,
      "shop_tax_rate": null,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "REFUND_ORDER_AMOUNT",
      "vat_rate": null
    },
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 0,
      "amount_debited": 100,
      "balance": 7111.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:28:19Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": null,
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": "TAXDEFAULT",
      "shop_tax_rate": 20,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "COMMISSION_VAT",
      "vat_rate": 20
    },
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 0,
      "amount_debited": 640,
      "balance": 7246.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:28:19Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": null,
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": null,
      "shop_tax_rate": 20,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "COMMISSION_FEE",
      "vat_rate": 20
    },
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 500,
      "amount_debited": 0,
      "balance": 7921.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:28:19Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": null,
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": null,
      "shop_tax_rate": null,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "ORDER_SHIPPING_AMOUNT",
      "vat_rate": null
    },
    {
      "accounting_document_creation_date": "2016-02-02T14:21:18Z",
      "accounting_document_number": "000000130190",
      "amount_credited": 5300,
      "amount_debited": 0,
      "balance": 7921.8,
      "category_code": "FOOTBALL_SHOES",
      "category_label": "Chaussures de Football, Crampons / Football Shoes, Spiked Shoes",
      "commission_grid_label": "Grille de commission par défaut - Niveau 1",
      "currency_iso_code": "EUR",
      "date_created": "2016-02-01T13:28:19Z",
      "invoice_creation_date": "2016-02-02T14:21:18Z",
      "invoice_number": 230190,
      "last_updated": "2016-02-02T14:21:22Z",
      "offer_price_unit": 300,
      "offer_sku": "S2056",
      "offer_state": "11",
      "order_commercial_id": "01022016-0003",
      "order_id": "01022016-0003-A",
      "order_line_id": "01022016-0003-A-1",
      "order_state": "RECEIVED",
      "order_tax_code": null,
      "payment_state": "PAID",
      "payment_voucher_number": "000001",
      "product_sku": "4055262935306",
      "product_title": "Evopower 4.2 Tt",
      "quantity": 15,
      "refund_id": null,
      "shipping_type_code": "SUV",
      "shipping_zone_code": "FR",
      "shop_id": 2001,
      "shop_name": "Smile Commissionée",
      "shop_operator_internal_id": null,
      "shop_tax_code": null,
      "shop_tax_rate": null,
      "transaction_date": null,
      "transaction_number": null,
      "transaction_type": "ORDER_AMOUNT",
      "vat_rate": null
    }
  ],
  "total_count": 8
}